Revit 2024 API
BuiltInFailures.EditingFailures.CannotEditDeletedElements Property
 Can't edit the element. It was deleted in the Central Model.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId CannotEditDeletedElements { get; }
Visual Basic
Public Shared ReadOnly Property CannotEditDeletedElements As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ CannotEditDeletedElements {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.EditingFailures Class
Autodesk.Revit.DB Namespace